#+TITLE: Calendar Data Generator
#+AUTHOR: Russell Brinson

*** Hasekll Implementation
#+BEGIN_SRC haskell :tangle calgen.hs
import System.Random
import System.IO

springWeather = [ ("Cold, gentle snow", 40)
                , ("Chilly, damp", 42)
                , ("Windy, cloudy", 42)
                , ("Brisk, clear", 45)
                , ("Clement, cheery", 50)
                , ("Warm, sunny", 60)
                , ("Bright, fresh", 61)
                , ("Blustery, drizzle", 55)
                , ("Pouring rain", 45)
                , ("Gloomy, cool", 43)
                , ("Chill mist", 41)
                ]

summerWeather = [ ("Cool winds", 60)
                , ("Low cloud, mist", 62)
                , ("Warm, gentle rain", 68)
                , ("Brooding thunder", 72)
                , ("Balmy, clear", 78)
                , ("Hot, humid", 85)
                , ("Overcast, muggy", 81)
                , ("Sweltering, still", 90)
                , ("Baking, dry", 87)
                , ("Warm wind", 79)
                , ("Thunder storm", 75)
                ]

autumnWeather = [ ("Torrential rain", 72)
                , ("Rolling fog", 68)
                , ("Driving rain", 67)
                , ("Bracing wind", 65)
                , ("Balmy, clement", 75)
                , ("Clear, chilly", 64)
                , ("Drizzle, damp", 65)
                , ("Cloudy, misty", 62)
                , ("Brooding clouds", 63)
                , ("Frosty, chill", 45)
                , ("Icy gentle snow", 32)
                ]

winterWeather = [ ("Deep freeze, hoarfrost", -10)
                , ("Snow storm", 22)
                , ("Relentless wind", 25)
                , ("Bitter, silent", 15)
                , ("Frigid, icy", 30)
                , ("Clear, cold", 35)
                , ("Freezing rain" , 32)
                , ("Cold wind, gloomy", 33)
                , ("Frigid mist", 31)
                , ("Icy, steady snow", 28)
                , ("Relentless blizzard", 25)
                ]

monthSeasons = [ ("New Years", springWeather) 
               , ("Joseon", springWeather)
               , ("Marta", springWeather)
               , ("Nox", summerWeather)
               , ("Luckless", summerWeather)
               , ("Fomhar", autumnWeather)
               , ("Marsbas", winterWeather)
               , ("Midwinter", winterWeather)
               , ("Cead", winterWeather)
               ]

#+END_SRC

#+RESULTS:
: ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> ghci> 
: <interactive>:333:18: error:
:     parse error (possibly incorrect indentation or mismatched brackets)




